import React from 'react';
import { useParams } from 'react-router-dom';

const BlogeDetailes = () => {
    const {Id}= useParams()
    return (
        <div className='mt-5 mb-5'>
            <h2 className='text-center'> Bloge ID {Id}</h2>
            <div className=' h-75 w-75 mx-auto'>
                <img className='blogs_imges' src="https://i.ibb.co/BP7jNqF/suzit.png" alt="" />
                <h4 className='mt-4'>ওয়েব ডেভেলপমেন্ট-এর চাহিদা কেমন? আর এর চাহিদা কি কমে যেতে পারে ভবিষ্যতে?</h4>
                <h4 className='mt-5'>২০২৩ সালে এসে কি ওয়েব ডেভলপমেন্ট শিখা কি সঠিক সিদ্ধান্ত হবে। </h4>
                <p className='blog_title'>ওয়েব ডেভেলপমেন্ট তথা ওয়েবের চাহিদা ক্রমাগত বাড়তেই থাকবে। বর্তমানে অনলাইন ভিত্তিক যত সেবা তৈরি হয়েছে গত ৫ বছর আগেও সেরকমটা ছিল না। মুদি দোকান থেকে শুরু করে সবকিছুই এখন অনলাইন ভিত্তিক। এগুলো মেইন্টেনেন্স এর জন্য কিংবা এক্সটেন্ড করার জন্য সবসময়ই ওয়েব ডেভেলপারের চাহিদা থাকবে। তাছাড়া অনলাইন ভিত্তিক যতো সেবা আসছে এগুলো বাস্তবায়নের জন্য ভবিষ্যতে ডেভেলপারদের চাহিদা তৈরি হবে। নেক্সট কয়েক বছরে কমবে না বরং বাড়বে বলে মনে হচ্ছে</p>
           
                <p className='blog_title'>১. আজ থেকে ৭-৮ বছর আগে ভাবছিলাম এপ ডেভেলপমেন্ট হয়তো ওয়েব ডেভেলপমেন্ট এর অনেক জব খেয়ে ফেলবে। তবে ২০২২-২৩ এসে মনে হচ্ছে-- মোবাইল ডেভেলপমেন্ট এর চাহিদা যে তালে বাড়ছে তার চাইতে বেশি তালে ওয়েব ডেভেলপমেন্ট এর জব বেড়েছে। এইটা আমি ধারণা করে বল</p>
           
                <p className='blog_title'>২. এন্টারটেইনমেন্ট, কমিউনিকেশন এবং শর্টকাটে সারা পসিবল এমন অনেক কাজ আমরা মোবাইল দিয়ে বেশি করি। এইসব জায়গায় এপ এবং এপ ডেভেলপার এর চাহিদা অবশ্যই বেড়েছে। সামনে আরো বাড়বে।</p>
           
            </div>
        </div>
    );
};

export default BlogeDetailes;